{
    "generalStats": {
      "infoContent": "Placeholder for General Stats Component info",
      "blurText": "Placeholder for General Stats Component blur text"
    },
    "lineChart": {
      "infoContent": "This module displays the daily impressions of high and low persuasive ads for selected political parties over time. It allows comparison between parties and persuasion levels.",
      "blurText": "<div class=\"long-description-content\"><p>This plot presents two time series, each showing the daily impressions of high and low persuasive ads for a selected political party.</p><p><strong>Key features of the plot:</strong></p><ol><li>Two separate time series: Users can select different political parties for each series, enabling direct comparisons.</li><li>High and low persuasive ads: Each time series distinguishes between high and low persuasive ad impressions, offering insights into the effectiveness of different ad types.</li><li>Daily data with smoothing: The plot shows daily data points, with a 3-day moving average applied to smooth out short-term fluctuations and highlight longer-term trends.</li><li>Impressions metric: The y-axis represents the number of ad impressions, indicating the reach of the political ads.</li></ol><p><strong>Data processing details:</strong></p><ul><li>The data is aggregated daily for each political party.</li><li>High and low persuasive impressions are calculated based on a persuasiveness score assigned to each ad.</li><li>A 3-day moving average is applied to all metrics to reduce noise and improve trend visibility.</li><li>The plot allows for the selection of specific parties, including an \"All\" option that shows data for the entire dataset.</li></ul><p>To interpret the graph, look for spikes in impressions, which may indicate increased ad activity during key political events and the differences in the ratio of high to low persuasive ad impressions between parties</p><p><strong>Note:</strong> This data represents impressions, not unique viewers. A single person may see multiple ads, contributing to multiple impressions.</p></div>"
    },
    "spendBarChart": {
      "infoContent": "NOTE: With 'others' we refer to ads that are not associated to any of the main political parties, but for which a party is available in the dataset. Instead, 'No Affiliation' refers to ads that are not associated to any party.",
      "blurText": "<div class=\"long-description-content\"><p><strong>Political Party Ad Spend Breakdown</strong></p><ul><li>Displays total ad spend for each political party</li><li>Differentiates between high and low persuasive ad spend</li><li>Data filtered based on selected date range</li></ul></div>"
    },
    "impressionsBarChart": {
      "infoContent": "NOTE: With 'others' we refer to ads that are not associated to any of the main political parties, but for which a party is available in the dataset. Instead, 'No Affiliation' refers to ads that are not associated to any party.",
      "blurText": "<div class=\"long-description-content\"><p><strong>Political Party Ad Impressions Overview</strong></p><ul><li>Shows total ad impressions for each political party</li><li>Separates impressions into high and low persuasive categories</li><li>Data adjusts based on the selected time period</li></ul></div>"
    },
    "pieChart": {
    "infoContent": "This module displays the distribution of ad impressions across the 3 different persuasion categories.",
    "blurText": "<div class=\"long-description-content\"><p><strong>Impressions Distribution Pie Chart</strong></p><ul><li>Visualizes the distribution of ad impressions across three categories: Other, High Persuasive, and Low Persuasive</li><li>Other refers to ads that are in-between of being high and low persuasive</li><li>Provides detailed information on hover, including percentage, total impressions, spend, and Cost Per Thousand Impressions (CPTI)</li><li>Allows for easy comparison of the relative reach of different ad types</li><li>Data updates based on the selected date range and political parties</li></ul><p><strong>Note:</strong> CPTI (Cost Per Thousand Impressions) is a metric that represents the cost of reaching 1,000 viewers.</p></div>"
  },
    "regionalDistribution": {
      "infoContent": "This module displays the regional distribution of political ad spend and impressions across Australian regions for the selected date range and political parties.",      
      "blurText": "<div class=\"long-description-content\"><p><strong>Spend and Impressions Australia map</strong></p><ul><li>Hover over any region on the map to view detailed statistics on ad spend and impressions for that location.</li><li>For each political ad, Meta provides a breakdown of the ad's audience location as a percentage of the total audience. This data is used to calculate regional spend and impressions.</li><li>To estimate geographic reach over a selected period and for the selected parties, we analyze the regional distribution data of individual ads, allocating a proportion of each ad's spend and impressions to different regions based on reported percentages. We then aggregate these allocations across all relevant ads to calculate total spend and impressions for each region</li></ul></div>"
    },
    "genderDemographics": {
      "infoContent": "NOTE: The 'unknown' gender category was not included since it's representation in the dataset is not statistically significant (around than 1%).",
      "blurText": "<div class=\"long-description-content\"><p><strong>Gender Demographics Bar Chart</strong></p><ul><li>Displays the distribution of ad impressions across different gender categories</li><li>Shows data for each political party, broken down into high persuasive, low persuasive and other impressions</li><li>Other refers to ads that are in-between of being high and low persuasive</li><li>Allows for easy comparison of gender targeting strategies across parties</li><li>Includes a custom tooltip with detailed impression counts for each category</li><li>Data updates based on the selected date range and political parties</li></ul><p><strong>Note:</strong> The chart uses different fill patterns to distinguish between high persuasive, low persuasive, and total impressions for each party.</p></div>"
    },
    "ageDemographics": {
      "infoContent": "NOTE: The 13-17 age group was not included since it's representation in the dataset is not statistically significant (less than 0.1%).",
      "blurText": "<div class=\"long-description-content\"><p><strong>Age Demographics Bar Chart</strong></p><ul><li>Illustrates the distribution of ad impressions across different age groups</li><li>Presents data for each political party, categorized into high persuasive, low persuasive and other impressions</li><li>Other refers to ads that are in-between of being high and low persuasive</li><li>Facilitates comparison of age-based targeting strategies among parties</li><li>Features a custom tooltip providing detailed impression counts for each age group</li><li>Data adjusts based on the selected date range and political parties</li></ul><p><strong>Note:</strong> The chart employs various fill patterns to differentiate between high persuasive, low persuasive, and total impressions for each party, enhancing visual clarity.</p></div>"
    }
  }